# Dirrerent ways to creating dataframe

In [1]:
import pandas as pd

### Creating DataFrame from lists of lists.

In [2]:
data = [['tom', 10], ['nick', 15], ['juli', 14]]

In [3]:
df = pd.DataFrame(data, columns = ['Name', 'Age'])

In [4]:
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

### Creating DataFrame from dict of narray/lists

In [5]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 
        'Age':[20, 21, 19, 18]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

### Creating Dataframe from list of dicts

In [8]:
data = [{'a': 1, 'b': 2, 'c':3}, 
        {'a':10, 'b': 20, 'c': 30},
        {'a': 5, 'b': 6, 'c':2}]

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    a   b   c
0   1   2   3
1  10  20  30
2   5   6   2

# Melt Function

In [12]:
Data = {
    "Day":["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"],
    "Gwalior":[39,36,49,43,37,35,31],
    "Delhi":[34,29,34,28,38,28,36]
}

In [13]:
x = pd.DataFrame(Data)

In [14]:
x

         Day  Gwalior  Delhi
0     Monday       39     34
1    Tuesday       36     29
2  Wednesday       49     34
3   Thursday       43     28
4     Friday       37     38
5   Saturday       35     28
6     Sunday       31     36

In [15]:
y = pd.melt(x, id_vars = ["Day"]) #for change variable name => var_name = "Jo Tumhe Rakhna Hai",value_name = "Jo Rakhna Hai"

In [16]:
y

          Day variable  value
0      Monday  Gwalior     39
1     Tuesday  Gwalior     36
2   Wednesday  Gwalior     49
3    Thursday  Gwalior     43
4      Friday  Gwalior     37
5    Saturday  Gwalior     35
6      Sunday  Gwalior     31
7      Monday    Delhi     34
8     Tuesday    Delhi     29
9   Wednesday    Delhi     34
10   Thursday    Delhi     28
11     Friday    Delhi     38
12   Saturday    Delhi     28
13     Sunday    Delhi     36

In [17]:
y[y["variable"] == "Gwalior"]

         Day variable  value
0     Monday  Gwalior     39
1    Tuesday  Gwalior     36
2  Wednesday  Gwalior     49
3   Thursday  Gwalior     43
4     Friday  Gwalior     37
5   Saturday  Gwalior     35
6     Sunday  Gwalior     31